
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПроверитьПодключение(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Сначала запишите информационную базу.'"));
		Возврат;
	КонецЕсли;
	
	ПроверитьПодключениеНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПроверитьПодключениеНаСервере()
	
	Попытка
		НастройкиАдминистрированияКластеров.ПроверитьПодключение(Объект.Ссылка);
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Подключение успешно.'"));
	Исключение
		ОбщегоНазначения.СообщитьПользователю(
			ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти
