
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.АдминистраторКластера.Видимость =
		ПраваУправленияСеансами.МожноПросматриватьУчетныеЗаписиАдминистрирования();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПроверитьПодключение(Команда)
	Если Объект.Ссылка.Пустая() Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Сначала запишите кластер.'"));
		Возврат;
	КонецЕсли;
	
	ПроверитьПодключениеНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПроверитьПодключениеНаСервере()
	Попытка
		НастройкиАдминистрированияКластеров.ПроверитьПодключениеКластера(Объект.Ссылка);
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Подключение успешно.'"));
	Исключение
		ОбщегоНазначения.СообщитьПользователю(
			ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
КонецПроцедуры

#КонецОбласти
