#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьПользователяПриСоздании();
	Если ЗначениеЗаполнено(Запись.Пользователь) Тогда
		Элементы.Пользователь.ТолькоПросмотр = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьПользователяПриСоздании()
	
	Если ЗначениеЗаполнено(Запись.Пользователь) Тогда
		Возврат;
	КонецЕсли;
	
	ПользовательЗаполнения = Неопределено;
	Если Параметры.Свойство("ЗначенияЗаполнения") Тогда
		Параметры.ЗначенияЗаполнения.Свойство("Пользователь", ПользовательЗаполнения);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПользовательЗаполнения) Тогда
		Запись.Пользователь = ПользовательЗаполнения;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
