#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ, Замещение)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ЧастиОписания = Новый Массив;
	Если Отбор.Пользователь.Использование Тогда
		ЧастиОписания.Добавить(СтрШаблон(НСтр("ru = 'Отбор по пользователю: %1.'"), Отбор.Пользователь.Значение));
	КонецЕсли;
	Если Отбор.ИнформационнаяБаза.Использование Тогда
		ЧастиОписания.Добавить(СтрШаблон(НСтр("ru = 'Отбор по базе: %1.'"), Отбор.ИнформационнаяБаза.Значение));
	КонецЕсли;
	
	Если Количество() = 0 Тогда
		ЧастиОписания.Добавить(НСтр("ru = 'Очищены разрешенные информационные базы.'"));
	Иначе
		Для Каждого ЗаписьНабора Из ЭтотОбъект Цикл
			ЧастиОписания.Добавить(СтрШаблон(
				НСтр("ru = 'Пользователь %1, база %2.'"),
				ЗаписьНабора.Пользователь,
				ЗаписьНабора.ИнформационнаяБаза));
		КонецЦикла;
	КонецЕсли;
	
	ИнформационнаяБаза = Неопределено;
	Если Отбор.ИнформационнаяБаза.Использование Тогда
		ИнформационнаяБаза = Отбор.ИнформационнаяБаза.Значение;
	ИначеЕсли Количество() = 1 Тогда
		ИнформационнаяБаза = ЭтотОбъект[0].ИнформационнаяБаза;
	КонецЕсли;
	
	ПротоколУправленияСеансами.ЗаписатьОперацию(
		Перечисления.ОперацииУправленияСеансами.ИзменениеНастроекАдминистрирования,
		ИнформационнаяБаза,
		СтрСоединить(ЧастиОписания, " "));
КонецПроцедуры

#КонецОбласти

#КонецЕсли
