#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередУдалением(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	ОбщегоНазначения.УдалитьДанныеИзБезопасногоХранилища(Ссылка);
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры
Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Описание = СтрШаблон(
		НСтр("ru = 'Записана учетная запись администрирования %1 (имя пользователя: %2).'"),
		Наименование,
		ИмяПользователя);
	ПротоколУправленияСеансами.ЗаписатьОперацию(
		Перечисления.ОперацииУправленияСеансами.ИзменениеНастроекАдминистрирования,
		Неопределено,
		Описание);
КонецПроцедуры

#КонецОбласти

#КонецЕсли
