
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		Если Не ЗначениеЗаполнено(Объект.ПортСервераАдминистрирования) Тогда
			Объект.ПортСервераАдминистрирования = 1545;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Объект.ПортКластера) Тогда
			Объект.ПортКластера = 1541;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПроверитьПодключение(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Сначала запишите кластер.'"));
		Возврат;
	КонецЕсли;
	
	ПроверитьПодключениеНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПроверитьПодключениеНаСервере()
	
	Попытка
		НастройкиАдминистрированияКластеров.ПроверитьПодключениеКластера(Объект.Ссылка);
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Подключение успешно.'"));
	Исключение
		ОбщегоНазначения.СообщитьПользователю(
			ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти
