#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Не ЗначениеЗаполнено(Владелец) Тогда
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Не указан кластер серверов.'"),
			ЭтотОбъект,
			"Владелец",
			,
			Отказ);
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИнформационныеБазыКластера.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ИнформационныеБазыКластера КАК ИнформационныеБазыКластера
		|ГДЕ
		|	ИнформационныеБазыКластера.Владелец = &Владелец
		|	И ИнформационныеБазыКластера.ИмяВКластере = &ИмяВКластере
		|	И ИнформационныеБазыКластера.Ссылка <> &Ссылка";
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.УстановитьПараметр("ИмяВКластере", ИмяВКластере);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Информационная база с таким именем в кластере уже существует.'"),
			ЭтотОбъект,
			"ИмяВКластере",
			,
			Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
